Integrador_BPEL/src/IntegradorWSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="IntegradorWSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/Integrador_BPEL/src/IntegradorWSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/Integrador_BPEL/src/IntegradorWSDL" xmlns:ns="http://xml.netbeans.org/schema/IntegradorSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/Integrador_BPEL/src/IntegradorWSDL">
            <xsd:import namespace="http://xml.netbeans.org/schema/IntegradorSchema" schemaLocation="IntegradorSchema.xsd"/>
        </xsd:schema>
    </types>
    <message name="IntegradorWSDLOperationRequest">
        <part name="part1" element="ns:eltoGestionaIn"/>
    </message>
    <message name="IntegradorWSDLOperationResponse">
        <part name="part1" element="ns:eltoGestionaOut"/>
    </message>
    <message name="IntegradorWSDLOperationFault">
        <part name="part1" element="ns:eltoGestionaOut"/>
    </message>
    <portType name="IntegradorWSDLPortType">
        <operation name="IntegradorWSDLOperation">
            <input name="input1" message="tns:IntegradorWSDLOperationRequest"/>
            <output name="output1" message="tns:IntegradorWSDLOperationResponse"/>
            <fault name="fault1" message="tns:IntegradorWSDLOperationFault"/>
        </operation>
    </portType>
    <plnk:partnerLinkType name="IntegradorWSDL">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="IntegradorWSDLPortTypeRole" portType="tns:IntegradorWSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>
